------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /home/albarran/Dropbox/UABCourse/TopicsCausalInference/log/01nsw.log
  log type:  text
 opened on:  17 Jun 2021, 10:15:03

. 
. *********************************************
. 
. use ./data/nsw.dta, replace

. 
. * Data checking
. describe

Contains data from ./data/nsw.dta
  obs:           445                          
 vars:            11                          11 Mar 2020 14:18
------------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
------------------------------------------------------------------------------------
data_id         str20   %20s                  
treat           float   %9.0g                 
age             float   %9.0g                 
educ            float   %9.0g                 
black           float   %9.0g                 
hisp            float   %9.0g                 
marr            float   %9.0g                 
nodegree        float   %9.0g                 
re74            float   %9.0g                 
re75            float   %9.0g                 
re78            float   %9.0g                 
------------------------------------------------------------------------------------
Sorted by: 

. 
end of do-file

. do "/tmp/SD77217.000000"

. 
. global XX "age educ black hisp marr nodegree"

. 
. foreach X of global XX {
  2.     display "`X'"
  3.     ttest `X', by(treat) unequal
  4. 
.     reg `X' treat, vce(robust)
  5. }
age

Two-sample t test with unequal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       0 |     260    25.05385    .4377027    7.057745    24.19194    25.91576
       1 |     185    25.81622    .5260475    7.155019    24.77836    26.85408
---------+--------------------------------------------------------------------
combined |     445    25.37079    .3365857    7.100282    24.70929    26.03229
---------+--------------------------------------------------------------------
    diff |           -.7623701    .6843315               -2.107777    .5830373
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =  -1.1140
Ho: diff = 0                     Satterthwaite's degrees of freedom =  393.109

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.1330         Pr(|T| > |t|) = 0.2659          Pr(T > t) = 0.8670

Linear regression                               Number of obs     =        445
                                                F(1, 443)         =       1.24
                                                Prob > F          =     0.2658
                                                R-squared         =     0.0028
                                                Root MSE          =     7.0983

------------------------------------------------------------------------------
             |               Robust
         age |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |   .7623701   .6842376     1.11   0.266     -.582385    2.107125
       _cons |   25.05385   .4378452    57.22   0.000     24.19333    25.91436
------------------------------------------------------------------------------
educ

Two-sample t test with unequal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       0 |     260    10.08846    .1001162    1.614325    9.891316    10.28561
       1 |     185    10.34595    .1478259     2.01065    10.05429     10.6376
---------+--------------------------------------------------------------------
combined |     445    10.19551    .0849546    1.792119    10.02854    10.36247
---------+--------------------------------------------------------------------
    diff |           -.2574844    .1785378                 -.60866    .0936912
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =  -1.4422
Ho: diff = 0                     Satterthwaite's degrees of freedom =  340.597

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.0751         Pr(|T| > |t|) = 0.1502          Pr(T > t) = 0.9249

Linear regression                               Number of obs     =        445
                                                F(1, 443)         =       2.08
                                                Prob > F          =     0.1499
                                                R-squared         =     0.0050
                                                Root MSE          =     1.7896

------------------------------------------------------------------------------
             |               Robust
        educ |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |   .2574844   .1785001     1.44   0.150    -.0933278    .6082966
       _cons |   10.08846   .1001488   100.73   0.000     9.891636    10.28529
------------------------------------------------------------------------------
black

Two-sample t test with unequal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       0 |     260    .8269231    .0235073    .3790434    .7806334    .8732128
       1 |     185    .8432432    .0268028    .3645579    .7903629    .8961236
---------+--------------------------------------------------------------------
combined |     445    .8337079    .0176706    .3727617    .7989795    .8684363
---------+--------------------------------------------------------------------
    diff |           -.0163202    .0356509               -.0864037    .0537634
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =  -0.4578
Ho: diff = 0                     Satterthwaite's degrees of freedom =  405.491

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.3237         Pr(|T| > |t|) = 0.6474          Pr(T > t) = 0.6763

Linear regression                               Number of obs     =        445
                                                F(1, 443)         =       0.21
                                                Prob > F          =     0.6473
                                                R-squared         =     0.0005
                                                Root MSE          =      .3731

------------------------------------------------------------------------------
             |               Robust
       black |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |   .0163202   .0356467     0.46   0.647    -.0537375    .0863778
       _cons |   .8269231   .0235149    35.17   0.000     .7807084    .8731377
------------------------------------------------------------------------------
hisp

Two-sample t test with unequal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       0 |     260    .1076923    .0192619    .3105893    .0697624    .1456222
       1 |     185    .0594595    .0174337    .2371244    .0250637    .0938552
---------+--------------------------------------------------------------------
combined |     445    .0876404    .0134197    .2830895    .0612664    .1140145
---------+--------------------------------------------------------------------
    diff |            .0482328    .0259799               -.0028271    .0992928
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =   1.8565
Ho: diff = 0                     Satterthwaite's degrees of freedom =  440.782

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.9680         Pr(|T| > |t|) = 0.0640          Pr(T > t) = 0.0320

Linear regression                               Number of obs     =        445
                                                F(1, 443)         =       3.45
                                                Prob > F          =     0.0640
                                                R-squared         =     0.0071
                                                Root MSE          =     .28241

------------------------------------------------------------------------------
             |               Robust
        hisp |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |  -.0482328   .0259792    -1.86   0.064    -.0992907     .002825
       _cons |   .1076923   .0192682     5.59   0.000     .0698239    .1455607
------------------------------------------------------------------------------
marr

Two-sample t test with unequal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       0 |     260    .1538462    .0224191    .3614971    .1096992    .1979931
       1 |     185    .1891892    .0288735    .3927217    .1322235    .2461548
---------+--------------------------------------------------------------------
combined |     445    .1685393    .0177656    .3747658    .1336242    .2034544
---------+--------------------------------------------------------------------
    diff |            -.035343    .0365553               -.1072217    .0365357
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =  -0.9668
Ho: diff = 0                     Satterthwaite's degrees of freedom =  375.723

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.1671         Pr(|T| > |t|) = 0.3342          Pr(T > t) = 0.8329

Linear regression                               Number of obs     =        445
                                                F(1, 443)         =       0.94
                                                Prob > F          =     0.3341
                                                R-squared         =     0.0022
                                                Root MSE          =     .37478

------------------------------------------------------------------------------
             |               Robust
        marr |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |    .035343   .0365494     0.97   0.334    -.0364887    .1071748
       _cons |   .1538462   .0224264     6.86   0.000     .1097708    .1979215
------------------------------------------------------------------------------
nodegree

Two-sample t test with unequal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       0 |     260    .8346154    .0230856    .3722439     .789156    .8800747
       1 |     185    .7081081     .033516    .4558666    .6419831    .7742331
---------+--------------------------------------------------------------------
combined |     445    .7820225     .019594    .4133367    .7435139    .8205311
---------+--------------------------------------------------------------------
    diff |            .1265073    .0406972                .0464612    .2065533
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =   3.1085
Ho: diff = 0                     Satterthwaite's degrees of freedom =  344.862

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.9990         Pr(|T| > |t|) = 0.0020          Pr(T > t) = 0.0010

Linear regression                               Number of obs     =        445
                                                F(1, 443)         =       9.67
                                                Prob > F          =     0.0020
                                                R-squared         =     0.0228
                                                Root MSE          =     .40906

------------------------------------------------------------------------------
             |               Robust
    nodegree |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |  -.1265073   .0406889    -3.11   0.002    -.2064745   -.0465401
       _cons |   .8346154   .0230931    36.14   0.000     .7892297     .880001
------------------------------------------------------------------------------

. 
. 
end of do-file

. do "/tmp/SD77217.000000"

. ttest re78, by(treat) unequal

Two-sample t test with unequal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       0 |     260    4554.801    340.0931    5483.836    3885.102    5224.501
       1 |     185    6349.144    578.4229    7867.402    5207.949    7490.338
---------+--------------------------------------------------------------------
combined |     445    5300.764    314.3629    6631.492     4682.94    5918.588
---------+--------------------------------------------------------------------
    diff |           -1794.342    670.9965               -3114.674   -474.0105
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =  -2.6741
Ho: diff = 0                     Satterthwaite's degrees of freedom =  307.132

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.0039         Pr(|T| > |t|) = 0.0079          Pr(T > t) = 0.9961

. 
. reg re78 treat, vce(robust)

Linear regression                               Number of obs     =        445
                                                F(1, 443)         =       7.15
                                                Prob > F          =     0.0078
                                                R-squared         =     0.0178
                                                Root MSE          =     6579.5

------------------------------------------------------------------------------
             |               Robust
        re78 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |   1794.342   670.8245     2.67   0.008     475.9486    3112.736
       _cons |   4554.801   340.2038    13.39   0.000     3886.187    5223.415
------------------------------------------------------------------------------

. 
end of do-file

. do "/tmp/SD77217.000000"

. gen agesq = age^2

. 
. reg re78 treat ${XX} agesq, vce(robust)

Linear regression                               Number of obs     =        445
                                                F(8, 436)         =       2.86
                                                Prob > F          =     0.0042
                                                R-squared         =     0.0484
                                                Root MSE          =     6528.2

------------------------------------------------------------------------------
             |               Robust
        re78 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |   1669.971   672.4847     2.48   0.013     348.2563    2991.686
         age |   178.2931   252.3748     0.71   0.480    -317.7294    674.3156
        educ |   378.0895   193.5129     1.95   0.051    -2.244584    758.4235
       black |  -2212.488   996.7206    -2.22   0.027    -4171.462   -253.5132
        hisp |   118.6311   1356.568     0.09   0.930    -2547.595    2784.857
        marr |   82.76498   934.2246     0.09   0.929    -1753.379    1918.909
    nodegree |  -106.8054   1050.525    -0.10   0.919    -2171.528    1957.917
       agesq |  -2.083698   4.023491    -0.52   0.605    -9.991547    5.824152
       _cons |  -421.9575   5024.842    -0.08   0.933    -10297.88    9453.966
------------------------------------------------------------------------------

. 
end of do-file

. do "/tmp/SD77217.000000"

. reg re78 treat $XX agesq, vce(robust)

Linear regression                               Number of obs     =        445
                                                F(8, 436)         =       2.86
                                                Prob > F          =     0.0042
                                                R-squared         =     0.0484
                                                Root MSE          =     6528.2

------------------------------------------------------------------------------
             |               Robust
        re78 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |   1669.971   672.4847     2.48   0.013     348.2563    2991.686
         age |   178.2931   252.3748     0.71   0.480    -317.7294    674.3156
        educ |   378.0895   193.5129     1.95   0.051    -2.244584    758.4235
       black |  -2212.488   996.7206    -2.22   0.027    -4171.462   -253.5132
        hisp |   118.6311   1356.568     0.09   0.930    -2547.595    2784.857
        marr |   82.76498   934.2246     0.09   0.929    -1753.379    1918.909
    nodegree |  -106.8054   1050.525    -0.10   0.919    -2171.528    1957.917
       agesq |  -2.083698   4.023491    -0.52   0.605    -9.991547    5.824152
       _cons |  -421.9575   5024.842    -0.08   0.933    -10297.88    9453.966
------------------------------------------------------------------------------

. 
end of do-file

. do "/tmp/SD77217.000000"

. gen higheduc = (educ>8)

. reg re78 treat i.treat##i.higheduc ${XX}, vce(robust)
note: 1.treat omitted because of collinearity

Linear regression                               Number of obs     =        445
                                                F(9, 435)         =       3.32
                                                Prob > F          =     0.0006
                                                R-squared         =     0.0528
                                                Root MSE          =     6520.4

--------------------------------------------------------------------------------
               |               Robust
          re78 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
         treat |  -108.7308   938.6081    -0.12   0.908    -1953.502     1736.04
       1.treat |          0  (omitted)
    1.higheduc |   485.7079   1259.342     0.39   0.700    -1989.443    2960.859
               |
treat#higheduc |
          1 1  |   2112.422   1200.541     1.76   0.079    -247.1602    4472.004
               |
           age |   54.80927   41.47591     1.32   0.187    -26.70883    136.3274
          educ |   118.7087   328.9289     0.36   0.718    -527.7787    765.1962
         black |  -2231.349   987.8973    -2.26   0.024    -4172.995   -289.7037
          hisp |  -53.40007   1335.935    -0.04   0.968     -2679.09     2572.29
          marr |   234.3704   893.8442     0.26   0.793     -1522.42    1991.161
      nodegree |   -552.035   1114.676    -0.50   0.621    -2742.855    1638.785
         _cons |   3841.158   3783.606     1.02   0.311    -3595.264    11277.58
--------------------------------------------------------------------------------

. 
end of do-file

. do "/tmp/SD77217.000000"

. **********************************************************************************
> **************
. *** DATA
. **********************************************************************************
> **************
. ** Original data from NSW (experimental RCT)
. 
. use https://github.com/albarran/TopicsCausalInference/raw/main/data/nsw.dta, clear

. 
. 
. * Now merge in the CPS controls from footnote 2 of Table 2 (Dehejia and Wahba 2002
> )
. append using https://github.com/albarran/TopicsCausalInference/raw/main/data/cps.d
> ta

. 
. gen agesq=age^2

. gen agecube=age^3

. gen edusq=educ^2

. 
. gen     u74 = 0 if re74!=.

. replace u74 = 1 if re74==0
(2,239 real changes made)

. 
. gen u75     = 0 if re75!=.

. replace u75 = 1 if re75==0
(2,037 real changes made)

. 
. gen interaction1 = educ*re74

. 
. gen re74sq=re74^2

. gen re75sq=re75^2

. 
. gen interaction2 = u74*hisp

. 
. compress
  variable treat was float now byte
  variable age was float now byte
  variable educ was float now byte
  variable black was float now byte
  variable hisp was float now byte
  variable marr was float now byte
  variable nodegree was float now byte
  variable agesq was float now int
  variable edusq was float now int
  variable u74 was float now byte
  variable u75 was float now byte
  variable interaction2 was float now byte
  (558,858 bytes saved)

. 
. **********************************************************************************
> **************
. **** Regression
. **********************************************************************************
> **************
. 
. reg re78 treat, vce(robust)

Linear regression                               Number of obs     =     16,437
                                                F(1, 16435)       =     205.09
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0082
                                                Root MSE          =       9663

------------------------------------------------------------------------------
             |               Robust
        re78 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |  -8332.867     581.87   -14.32   0.000    -9473.395   -7192.338
       _cons |   14682.01   75.94493   193.32   0.000     14533.15    14830.87
------------------------------------------------------------------------------

. 
. reg re78 treat age agesq agecube educ edusq marr nodegree black hisp re74 re75 u74
>  u75 interaction1, vce(robust)

Linear regression                               Number of obs     =     16,437
                                                F(15, 16421)      =    1250.41
                                                Prob > F          =     0.0000
                                                R-squared         =     0.4845
                                                Root MSE          =     6969.6

------------------------------------------------------------------------------
             |               Robust
        re78 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |   1518.637   622.2849     2.44   0.015     298.8907    2738.382
         age |   -860.529   178.9564    -4.81   0.000    -1211.303   -509.7551
       agesq |   20.51622     5.2594     3.90   0.000     10.20722    30.82521
     agecube |  -.1744923   .0492144    -3.55   0.000    -.2709578   -.0780268
        educ |   31.85693   89.12945     0.36   0.721    -142.8465    206.5603
       edusq |   13.25094   3.877853     3.42   0.001     5.649923    20.85195
        marr |   334.7757   152.6631     2.19   0.028     35.53942    634.0119
    nodegree |   121.1517    179.046     0.68   0.499    -229.7978    472.1012
       black |  -812.9132   186.0289    -4.37   0.000     -1177.55   -448.2763
        hisp |  -215.0727   216.7613    -0.99   0.321    -639.9483    209.8029
        re74 |   .4440733   .0305466    14.54   0.000     .3841986    .5039479
        re75 |   .4477717   .0158506    28.25   0.000     .4167027    .4788406
         u74 |   299.2302   232.5373     1.29   0.198     -156.568    755.0285
         u75 |  -1404.489   244.8534    -5.74   0.000    -1884.428   -924.5494
interaction1 |  -.0120719   .0020947    -5.76   0.000    -.0161777   -.0079661
       _cons |   14127.56   2041.311     6.92   0.000     10126.37    18128.75
------------------------------------------------------------------------------

. 
. ** more general form of regression 
. 
. reg re78 i.treat##(c.age c.agesq c.agecube c.educ c.edusq i.marr i.nodegree i.blac
> k i.hisp c.re74 c.re75 i.u74 i.u75 c.interaction1), vce(robust) 

Linear regression                               Number of obs     =     16,437
                                                F(29, 16407)      =     660.83
                                                Prob > F          =     0.0000
                                                R-squared         =     0.4863
                                                Root MSE          =     6960.6

---------------------------------------------------------------------------------
                |               Robust
           re78 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
        1.treat |   20861.03   22780.86     0.92   0.360    -23791.92    65513.98
            age |  -925.4615   179.4184    -5.16   0.000    -1277.141   -573.7819
          agesq |    22.1252   5.272849     4.20   0.000     11.78984    32.46056
        agecube |  -.1872468   .0493361    -3.80   0.000    -.2839509   -.0905427
           educ |   30.01824   89.61429     0.33   0.738    -145.6355     205.672
          edusq |   13.54861   3.886347     3.49   0.000     5.930952    21.16628
         1.marr |    364.897   153.3847     2.38   0.017     64.24632    665.5477
     1.nodegree |   134.9659   179.5469     0.75   0.452    -216.9655    486.8972
        1.black |  -787.0277   187.3691    -4.20   0.000    -1154.292   -419.7639
         1.hisp |  -208.9171   217.3903    -0.96   0.337    -635.0257    217.1914
           re74 |   .4478037   .0306656    14.60   0.000     .3876958    .5079115
           re75 |   .4461641   .0158755    28.10   0.000     .4150464    .4772817
          1.u74 |   145.9243   232.2948     0.63   0.530    -309.3987    601.2473
          1.u75 |  -1426.309    243.374    -5.86   0.000    -1903.349   -949.2698
   interaction1 |  -.0122944   .0021031    -5.85   0.000    -.0164168   -.0081721
                |
    treat#c.age |
             1  |  -1988.114     2292.8    -0.87   0.386    -6482.251    2506.023
                |
  treat#c.agesq |
             1  |   91.97559   78.95443     1.16   0.244    -62.78367    246.7349
                |
treat#c.agecube |
             1  |  -1.176869   .8601527    -1.37   0.171    -2.862862    .5091236
                |
   treat#c.educ |
             1  |  -2656.752   1754.261    -1.51   0.130    -6095.293    781.7895
                |
  treat#c.edusq |
             1  |   152.3052   103.4315     1.47   0.141    -50.43179    355.0422
                |
     treat#marr |
           1 1  |   58.72302   1427.593     0.04   0.967    -2739.514     2856.96
                |
 treat#nodegree |
           1 1  |   758.3989   2121.031     0.36   0.721    -3399.053    4915.851
                |
    treat#black |
           1 1  |   242.0007   1727.575     0.14   0.889    -3144.233    3628.234
                |
     treat#hisp |
           1 1  |   1782.879    2755.37     0.65   0.518    -3617.945    7183.702
                |
   treat#c.re74 |
             1  |   -1.40625   .6885891    -2.04   0.041    -2.755959   -.0565406
                |
   treat#c.re75 |
             1  |  -.4053008    .220376    -1.84   0.066    -.8372617    .0266602
                |
      treat#u74 |
           1 1  |   5264.976   2570.995     2.05   0.041     225.5462    10304.41
                |
      treat#u75 |
           1 1  |  -2611.697   2786.807    -0.94   0.349    -8074.142    2850.748
                |
          treat#|
 c.interaction1 |
             1  |   .1118816   .0645419     1.73   0.083    -.0146276    .2383907
                |
          _cons |   14919.82   2043.186     7.30   0.000     10914.96    18924.69
---------------------------------------------------------------------------------

. 
. margins         , dydx(treat)

Average marginal effects                        Number of obs     =     16,437
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : 1.treat

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     1.treat |          .  (not estimable)
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

. margins if treat, dydx(treat)

Average marginal effects                        Number of obs     =        185
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : 1.treat

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
          0  |          0  (empty)
          1  |          .  (not estimable)
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

. 
. teffects ra (re78  ${XX}) (treat), vce(robust)

Iteration 0:   EE criterion =  1.902e-22  
Iteration 1:   EE criterion =  1.939e-24  

Treatment-effects estimation                    Number of obs     =     16,437
Estimator      : regression adjustment
Outcome model  : linear
Treatment model: none
------------------------------------------------------------------------------
             |               Robust
        re78 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ATE          |
       treat |
   (1 vs 0)  |  -5003.605   1440.201    -3.47   0.001    -7826.348   -2180.862
-------------+----------------------------------------------------------------
POmean       |
       treat |
          0  |   14614.14   75.89464   192.56   0.000     14465.39    14762.89
------------------------------------------------------------------------------

. teffects ra (re78  ${XX}) (treat), vce(robust) atet

Iteration 0:   EE criterion =  1.891e-22  
Iteration 1:   EE criterion =  1.495e-25  

Treatment-effects estimation                    Number of obs     =     16,437
Estimator      : regression adjustment
Outcome model  : linear
Treatment model: none
------------------------------------------------------------------------------
             |               Robust
        re78 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ATET         |
       treat |
   (1 vs 0)  |  -2302.696   607.0922    -3.79   0.000    -3492.575   -1112.818
-------------+----------------------------------------------------------------
POmean       |
       treat |
          0  |    8651.84   272.6246    31.74   0.000     8117.506    9186.174
------------------------------------------------------------------------------

. 
end of do-file

. do "/tmp/SD77217.000000"

. **********************************************************************************
> **************
. *** DATA
. **********************************************************************************
> **************
. ** Original data from NSW (experimental RCT)
. 
. use https://github.com/albarran/TopicsCausalInference/raw/main/data/nsw.dta, clear

. 
. 
. * Now merge in the CPS controls from footnote 2 of Table 2 (Dehejia and Wahba 2002
> )
. append using https://github.com/albarran/TopicsCausalInference/raw/main/data/cps.d
> ta

. 
. gen agesq=age^2

. gen agecube=age^3

. gen edusq=educ^2

. 
. gen     u74 = 0 if re74!=.

. replace u74 = 1 if re74==0
(2,239 real changes made)

. 
. gen u75     = 0 if re75!=.

. replace u75 = 1 if re75==0
(2,037 real changes made)

. 
. gen interaction1 = educ*re74

. 
. gen re74sq=re74^2

. gen re75sq=re75^2

. 
. gen interaction2 = u74*hisp

. 
. compress
  variable treat was float now byte
  variable age was float now byte
  variable educ was float now byte
  variable black was float now byte
  variable hisp was float now byte
  variable marr was float now byte
  variable nodegree was float now byte
  variable agesq was float now int
  variable edusq was float now int
  variable u74 was float now byte
  variable u75 was float now byte
  variable interaction2 was float now byte
  (558,858 bytes saved)

. 
. **********************************************************************************
> **************
. **** Regression
. **********************************************************************************
> **************
. 
. reg re78 treat, vce(robust)

Linear regression                               Number of obs     =     16,437
                                                F(1, 16435)       =     205.09
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0082
                                                Root MSE          =       9663

------------------------------------------------------------------------------
             |               Robust
        re78 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |  -8332.867     581.87   -14.32   0.000    -9473.395   -7192.338
       _cons |   14682.01   75.94493   193.32   0.000     14533.15    14830.87
------------------------------------------------------------------------------

. 
. reg re78 treat age agesq agecube educ edusq marr nodegree black hisp re74 re75, vc
> e(robust)

Linear regression                               Number of obs     =     16,437
                                                F(12, 16424)      =    1497.85
                                                Prob > F          =     0.0000
                                                R-squared         =     0.4821
                                                Root MSE          =       6985

------------------------------------------------------------------------------
             |               Robust
        re78 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |    1064.48   613.9569     1.73   0.083    -138.9422    2267.902
         age |  -734.3332   175.7299    -4.18   0.000    -1078.783   -389.8836
       agesq |   16.72641   5.179508     3.23   0.001     6.574015    26.87881
     agecube |  -.1393208   .0485684    -2.87   0.004    -.2345202   -.0441215
        educ |  -57.22486   89.65744    -0.64   0.523    -232.9632    118.5134
       edusq |   9.343116   3.716433     2.51   0.012     2.058505    16.62773
        marr |   292.2367   152.8894     1.91   0.056    -7.443056    591.9164
    nodegree |   104.6569   178.6235     0.59   0.558    -245.4646    454.7784
       black |  -938.8067   185.0022    -5.07   0.000    -1301.431   -576.1823
        hisp |   -218.056   216.8116    -1.01   0.315    -643.0302    206.9182
        re74 |    .292412   .0152012    19.24   0.000      .262616     .322208
        re75 |   .4738356   .0152793    31.01   0.000     .4438865    .5037846
       _cons |   14136.85   2015.853     7.01   0.000     10185.56    18088.14
------------------------------------------------------------------------------

. 
. ** more general form of regression 
. 
. reg re78 i.treat##(c.age c.agesq c.agecube c.educ c.edusq i.marr i.nodegree i.blac
> k i.hisp c.re74 c.re75), vce(robust) 

Linear regression                               Number of obs     =     16,437
                                                F(23, 16413)      =     795.32
                                                Prob > F          =     0.0000
                                                R-squared         =     0.4833
                                                Root MSE          =     6979.5

---------------------------------------------------------------------------------
                |               Robust
           re78 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
        1.treat |   19152.12   24082.14     0.80   0.426    -28051.49    66355.73
            age |  -781.3437   176.3359    -4.43   0.000    -1126.981   -435.7061
          agesq |   17.79513   5.196168     3.42   0.001     7.610081    27.98019
        agecube |  -.1471167   .0487137    -3.02   0.003    -.2426009   -.0516325
           educ |  -66.73611   90.01386    -0.74   0.458     -243.173    109.7008
          edusq |   9.713725   3.726803     2.61   0.009     2.408787    17.01866
         1.marr |   316.5874   153.5794     2.06   0.039     15.55506    617.6197
     1.nodegree |   112.0167    179.039     0.63   0.532    -238.9193    462.9526
        1.black |  -923.3859   186.4565    -4.95   0.000    -1288.861    -557.911
         1.hisp |  -211.9238   217.5335    -0.97   0.330     -638.313    214.4653
           re74 |   .2959531   .0152364    19.42   0.000     .2660881     .325818
           re75 |   .4732155   .0153116    30.91   0.000     .4432031    .5032278
                |
    treat#c.age |
             1  |  -1871.064   2381.237    -0.79   0.432    -6538.547     2796.42
                |
  treat#c.agesq |
             1  |    88.3326   80.88326     1.09   0.275    -70.20736    246.8726
                |
treat#c.agecube |
             1  |  -1.142184   .8731059    -1.31   0.191    -2.853566    .5691987
                |
   treat#c.educ |
             1  |  -2591.348   1991.572    -1.30   0.193    -6495.045    1312.348
                |
  treat#c.edusq |
             1  |   168.7993   120.3262     1.40   0.161    -67.05306    404.6517
                |
     treat#marr |
           1 1  |   543.7034   1470.998     0.37   0.712    -2339.613    3427.019
                |
 treat#nodegree |
           1 1  |    1089.73   2348.231     0.46   0.643    -3513.058    5692.518
                |
    treat#black |
           1 1  |   -254.968   1646.755    -0.15   0.877    -3482.787    2972.851
                |
     treat#hisp |
           1 1  |   882.9243   2656.562     0.33   0.740    -4324.226    6090.075
                |
   treat#c.re74 |
             1  |  -.2611288   .2342076    -1.11   0.265    -.7202012    .1979435
                |
   treat#c.re75 |
             1  |   -.407672   .2031268    -2.01   0.045    -.8058225   -.0095214
                |
          _cons |   14768.57   2020.423     7.31   0.000     10808.32    18728.81
---------------------------------------------------------------------------------

. 
. margins         , dydx(treat)

Average marginal effects                        Number of obs     =     16,437
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : 1.treat

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     1.treat |          .  (not estimable)
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

. margins if treat, dydx(treat)

Average marginal effects                        Number of obs     =        185
Model VCE    : Robust

Expression   : Linear prediction, predict()
dy/dx w.r.t. : 1.treat

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
          0  |          0  (empty)
          1  |          .  (not estimable)
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

. 
. teffects ra (re78  ${XX}) (treat), vce(robust)

Iteration 0:   EE criterion =  1.902e-22  
Iteration 1:   EE criterion =  1.939e-24  

Treatment-effects estimation                    Number of obs     =     16,437
Estimator      : regression adjustment
Outcome model  : linear
Treatment model: none
------------------------------------------------------------------------------
             |               Robust
        re78 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ATE          |
       treat |
   (1 vs 0)  |  -5003.605   1440.201    -3.47   0.001    -7826.348   -2180.862
-------------+----------------------------------------------------------------
POmean       |
       treat |
          0  |   14614.14   75.89464   192.56   0.000     14465.39    14762.89
------------------------------------------------------------------------------

. teffects ra (re78  ${XX}) (treat), vce(robust) atet

Iteration 0:   EE criterion =  1.891e-22  
Iteration 1:   EE criterion =  1.495e-25  

Treatment-effects estimation                    Number of obs     =     16,437
Estimator      : regression adjustment
Outcome model  : linear
Treatment model: none
------------------------------------------------------------------------------
             |               Robust
        re78 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ATET         |
       treat |
   (1 vs 0)  |  -2302.696   607.0922    -3.79   0.000    -3492.575   -1112.818
-------------+----------------------------------------------------------------
POmean       |
       treat |
          0  |    8651.84   272.6246    31.74   0.000     8117.506    9186.174
------------------------------------------------------------------------------

. 
. 
. **********************************************************************************
> **************
. * Now estimate the propensity score
. **********************************************************************************
> **************
. 
. logit treat age agesq agecube educ edusq marr nodegree black hisp re74 re75 

Iteration 0:   log likelihood = -1014.0378  
Iteration 1:   log likelihood = -725.83429  
Iteration 2:   log likelihood =  -593.0301  
Iteration 3:   log likelihood = -545.65072  
Iteration 4:   log likelihood = -542.58762  
Iteration 5:   log likelihood = -542.53614  
Iteration 6:   log likelihood = -542.53613  

Logistic regression                             Number of obs     =     16,437
                                                LR chi2(11)       =     943.00
                                                Prob > chi2       =     0.0000
Log likelihood = -542.53613                     Pseudo R2         =     0.4650

------------------------------------------------------------------------------
       treat |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |   1.200123   .3098533     3.87   0.000     .5928215    1.807424
       agesq |  -.0319805   .0100392    -3.19   0.001    -.0516571    -.012304
     agecube |   .0002549   .0001028     2.48   0.013     .0000535    .0004563
        educ |   .5558239   .2169711     2.56   0.010     .1305685    .9810794
       edusq |  -.0343907    .011573    -2.97   0.003    -.0570733    -.011708
        marr |  -.9515597   .2232235    -4.26   0.000     -1.38907   -.5140498
    nodegree |   .2265849   .2813634     0.81   0.421    -.3248772    .7780471
       black |   3.308134   .2628883    12.58   0.000     2.792882    3.823385
        hisp |   1.584349   .3937106     4.02   0.000     .8126902    2.356008
        re74 |  -.0000488   .0000259    -1.88   0.060    -.0000995    1.98e-06
        re75 |  -.0001636   .0000334    -4.90   0.000     -.000229   -.0000982
       _cons |   -19.7578   3.239693    -6.10   0.000    -26.10748   -13.40812
------------------------------------------------------------------------------

. predict pscore
(option pr assumed; Pr(treat))

. 
. * Checking mean propensity scores for treatment and control groups
. su pscore if treat==1, detail

                          Pr(treat)
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0022068       .0022039
 5%      .007049       .0022068
10%     .0158501       .0025748       Obs                 185
25%      .104596        .003058       Sum of Wgt.         185

50%     .1793571                      Mean           .2096305
                        Largest       Std. Dev.      .1455678
75%     .2972358       .5297678
90%     .4322276        .532092       Variance         .02119
95%     .4590292       .5365275       Skewness       .4523643
99%     .5365275       .5369399       Kurtosis        2.33184

. su pscore if treat==0, detail

                          Pr(treat)
-------------------------------------------------------------
      Percentiles      Smallest
 1%     9.85e-07       1.73e-07
 5%     3.88e-06       1.73e-07
10%     7.64e-06       1.73e-07       Obs              16,252
25%     .0000312       1.73e-07       Sum of Wgt.      16,252

50%     .0002731                      Mean           .0089969
                        Largest       Std. Dev.      .0419526
75%     .0024815       .5074558
90%     .0077279       .5297678       Variance         .00176
95%     .0275599        .532092       Skewness       7.583132
99%      .222597       .5365275       Kurtosis       68.71642

. 
. * Now look at the propensity score distribution for treatment and control groups
. histogram pscore, by(treat) binrescale

. 
. 
. **** Checking balancing
. 
. capture ssc install covbal

. 
. covbal treat age educ  marr nodegree black hisp re74 re75



             |             Treated             |             Control             
             |      Mean   Variance   Skewness |      Mean   Variance   Skewness 
-------------+---------------------------------+---------------------------------
         age |  25.81622    51.1943   1.115369 |  33.09451     121.89    .362945 
        educ |  10.34595   4.042714  -.7211515 |  11.99649   8.210621   -.404336 
        marr |  .1891892   .1542303   1.587151 |  .7028058   .2088827  -.8875086 
    nodegree |  .7081081   .2078143  -.9154997 |  .3044548   .2117751   .8498709 
       black |  .8432432   .1329025  -1.888176 |  .0855895   .0782687   2.962648 
        hisp |  .0594595    .056228   3.725775 |  .0726064   .0673389   3.294112 
        re74 |  2095.574   2.39e+07   3.386881 |  13826.27   9.29e+07  -.1519223 
        re75 |  1532.055   1.04e+07    3.78028 |  13452.69   8.71e+07  -.1379853 
---------------------------------------------------------------------------------

             |        Balance       
             |  Std-diff  Var-ratio 
-------------+----------------------
         age | -.7823765    .420004 
        educ | -.6668308   .4923762 
        marr | -1.205406   .7383587 
    nodegree |  .8812745   .9812972 
       black |  2.331677   1.698028 
        hisp |  -.052892   .8349998 
        re74 | -1.535403   .2571389 
        re75 | -1.707336   .1189394 
------------------------------------



. 
. gen ipww=1/ps*treat+1/(1-ps)*(1-treat)

. covbal treat age educ  marr nodegree black hisp re74 re75, wt(ipww)



             |             Treated             |             Control             
             |      Mean   Variance   Skewness |      Mean   Variance   Skewness 
-------------+---------------------------------+---------------------------------
         age |  26.91979   54.79625   .7094298 |  33.01083   121.6347   .3733455 
        educ |  11.35463   3.638179  -.7414507 |  11.97661    8.19237  -.3939185 
        marr |  .4599773   .2497482    .160606 |  .6966534   .2113404  -.8555661 
    nodegree |   .468503   .2503612   .1262388 |  .3093764   .2136758   .8247881 
       black |  .3930748   .2398636   .4378292 |  .0945635   .0856265   2.771163 
        hisp |  .1059651   .0952513    2.56039 |  .0724062   .0671677   3.299852 
        re74 |  7178.217   9.74e+07   1.704859 |  13688.06   9.36e+07  -.1319968 
        re75 |  5916.644   5.78e+07   1.429868 |   13311.9   8.79e+07  -.1178486 
---------------------------------------------------------------------------------

             |        Balance       
             |  Std-diff  Var-ratio 
-------------+----------------------
         age | -.6485125   .4504983 
        educ |  -.255734   .4440936 
        marr | -.4929208   1.181734 
    nodegree |  .3303554   1.171687 
       black |  .7399578   2.801277 
        hisp |  .1177615   1.418112 
        re74 | -.6661693   1.040774 
        re75 | -.8664285   .6576222 
------------------------------------



. 
. 
. **********************************************************************************
> **************
. * IPW
. **********************************************************************************
> **************
. 
. * Use teffects to calculate inverse probability weighted regression
. 
. gen re78_scaled = re78/10000

. cap n teffects ipw (re78_scaled) (treat age agesq agecube educ edusq marr nodegree
>  black hisp re74 re75, logit), osample(overlap) atet

Iteration 0:   EE criterion =  3.364e-17  
Iteration 1:   EE criterion =  5.574e-30  

Treatment-effects estimation                    Number of obs     =     16,437
Estimator      : inverse-probability weights
Outcome model  : weighted mean
Treatment model: logit
------------------------------------------------------------------------------
             |               Robust
 re78_scaled |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ATET         |
       treat |
   (1 vs 0)  |   .1354905   .0632495     2.14   0.032     .0115238    .2594572
-------------+----------------------------------------------------------------
POmean       |
       treat |
          0  |   .4994239   .0302052    16.53   0.000     .4402228    .5586249
------------------------------------------------------------------------------

. keep if overlap==0
(0 observations deleted)

. drop overlap

. 
. cap n teffects ipw (re78_scaled) (treat age agesq agecube educ edusq marr nodegree
>  black hisp re74 re75, logit), osample(overlap) atet

Iteration 0:   EE criterion =  3.364e-17  
Iteration 1:   EE criterion =  5.574e-30  

Treatment-effects estimation                    Number of obs     =     16,437
Estimator      : inverse-probability weights
Outcome model  : weighted mean
Treatment model: logit
------------------------------------------------------------------------------
             |               Robust
 re78_scaled |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ATET         |
       treat |
   (1 vs 0)  |   .1354905   .0632495     2.14   0.032     .0115238    .2594572
-------------+----------------------------------------------------------------
POmean       |
       treat |
          0  |   .4994239   .0302052    16.53   0.000     .4402228    .5586249
------------------------------------------------------------------------------

. cap drop overlap

. 
. 
. **********************************************************************************
> **************
. * matching
. **********************************************************************************
> **************
. 
. ** Exact matching
. 
. 
. capture teffects nnmatch (re78) (treat), atet ematch(black hisp marr educ) atet

.             //---- FAILS, of course
.             
.  
. * Nearest neighbor matching
. teffects nnmatch (re78  age agesq agecube educ edusq marr nodegree black hisp re74
>  re75) (treat) , atet

Treatment-effects estimation                   Number of obs      =     16,437
Estimator      : nearest-neighbor matching     Matches: requested =          1
Outcome model  : matching                                     min =          1
Distance metric: Mahalanobis                                  max =          9
------------------------------------------------------------------------------
             |              AI Robust
        re78 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ATET         |
       treat |
   (1 vs 0)  |   1943.799   707.7762     2.75   0.006     556.5834    3331.015
------------------------------------------------------------------------------

. 
. teffects nnmatch (re78  age agesq agecube educ edusq marr nodegree black hisp re74
>  re75) (treat) , atet nn(5)

Treatment-effects estimation                   Number of obs      =     16,437
Estimator      : nearest-neighbor matching     Matches: requested =          5
Outcome model  : matching                                     min =          5
Distance metric: Mahalanobis                                  max =         11
------------------------------------------------------------------------------
             |              AI Robust
        re78 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ATET         |
       treat |
   (1 vs 0)  |   1343.639   654.4745     2.05   0.040     60.89252    2626.385
------------------------------------------------------------------------------

. 
. teffects nnmatch (re78  age agesq agecube educ edusq marr nodegree black hisp re74
>  re75) (treat) , atet biasadj(age agesq educ re74 re75)

Treatment-effects estimation                   Number of obs      =     16,437
Estimator      : nearest-neighbor matching     Matches: requested =          1
Outcome model  : matching                                     min =          1
Distance metric: Mahalanobis                                  max =          9
------------------------------------------------------------------------------
             |              AI Robust
        re78 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ATET         |
       treat |
   (1 vs 0)  |   1890.221    707.091     2.67   0.008     504.3486    3276.094
------------------------------------------------------------------------------

. 
. 
. ** PS matching
. teffects psmatch (re78) (treat age agesq agecube educ edusq marr nodegree black hi
> sp re74 re75 logit), atet gen(pstub_cps) nn(3) 
variable logit not found
    The treatment-model is misspecified.
    An outline of the syntax is
    teffects psmatch (outcome_variable) (treatment_variable varlist)
r(111);

end of do-file

r(111);

. clear

. cls

. exit, clear
